IDEA Open Model
MatPrestressSteelEc2 Properties
The MatPrestressSteelEc2 type exposes the following members.
Properties
Name | Description
Agt
 Total elongation at max. force (prEN 10138)
Area
 Area
 (Inherited from MatPrestressSteel.)
DiagramType
 Type of diagram
Diameter
 Diameter
 (Inherited from MatPrestressSteel.)
E
 Young's modulus
 (Inherited from Material.)
Epsuk
 Characteristic strain at maximum load (EN 1992-1-1)
EquivalentDiameter
 Equivalent diameter
 (Inherited from MatPrestressSteel.)
Fm
 Char. value of max. force (prEN 10138)
Fp01
 Char. 0.1% proof force
Fp01k
 0,1% proof-stress (EN 1992-1-1)
Fpk
 Characteristic tensile strength (EN 1992-1-1)
Fr
 Fatigue stress range (prEN 10138)
G
 Shear modulus
 (Inherited from Material.)
Id
 Element Id
 (Inherited from OpenElementId.)
IsDefaultMaterial
 True if material is default material from the code
 (Inherited from Material.)
Name
 Name of material
 (Inherited from Material.)
NumberOfWires
 number of wires in strand
 (Inherited from MatPrestressSteel.)
OrderInCode
 Order of this material in the code
 (Inherited from Material.)
Poisson
 Poisson's ratio
 (Inherited from Material.)
Production
 Production type
SpecificHeat
 Specific heat capacity
 (Inherited from Material.)
StateOfThermalConductivity
 State of thermal conductivity curvature
 (Inherited from Material.)
StateOfThermalExpansion
 State of thermal expansion curvature
 (Inherited from Material.)
StateOfThermalSpecificHeat
 State of thermal specific heat curvature
 (Inherited from Material.)
StateOfThermalStrain
 State of thermal strain curvature
 (Inherited from Material.)
StateOfThermalStressStrain
 State of thermal specific stress-strain curvature
 (Inherited from Material.)
SurfaceCharacteristic
 Surface characteristic
ThermalConductivity
 Thermal conductivity
 (Inherited from Material.)
ThermalExpansion
 Thermal expansion
 (Inherited from Material.)
Type
 Type of prestress steel
UnitMass
 Unit weight
 (Inherited from Material.)
UserThermalConductivityCurvature
 User-defined curvature for thermal conductivity curvature { x = Θ[K], y = λc[W/(m K)] }
 (Inherited from Material.)
UserThermalExpansionCurvature
 User-defined curvature for thermal expansion curvature { x = Θ[K], y = γ[K-1] }
 (Inherited from Material.)
UserThermalSpecificHeatCurvature
 User-defined curvature for thermal specific heat { x = Θ[K], y = cp[J/(kg K)] }
 (Inherited from Material.)
UserThermalStrainCurvature
 User-defined curvature for thermal strain curvature { x = Θ[K], y = εc[Δl/l] }
 (Inherited from Material.)
UserThermalStressStrainCurvature
 User-defined curvature for thermal stress,strain { Temperature = Θ[K], {x = ε[-], y = σ[Pa]}}
 (Inherited from Material.)
Top
See Also
Reference
MatPrestressSteelEc2 Class
IdeaRS.OpenModel.Material Namespace